Reports/СостояниеАгентовТелефонииРасширенный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>СостояниеАгентовТелефонииРасширенный</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяОчередь</Name>
					<Comment>Одна из доступных очередей, данные об агентах которой отображаются на основной странице</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦелевыеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеОчереди</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчередьКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчередьНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АгентыТекущейОчереди</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пауза</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТелВнутр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелеваяТочка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВладелецТелВнутр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачБлокировки</Name>
							<Comment>Дата и время начала блокировки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонБлокировки</Name>
							<Comment>Дата и время окончания блокировки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстБлокировки</Name>
							<Comment>Причина блокировки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторБлокировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТелВнутрСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СостояниеАгентовТелефонииРасширенный/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Отчет.ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Доступно = ПараметрыСеанса.РольДоступнаАдминистратор;
	
	
	ДоступныеЦелевыеОчереди = ДоступСервер.ДоступныеЦелевыеОчереди(ЭтаФорма.Отчет.ТекущийПользователь);
	
	Если ДоступныеЦелевыеОчереди.Количество() = 0 Тогда
		Сообщить("У вас нет доступных целевых очередей для просмотра");
		Отказ = Истина;
	КонецЕсли;
	
	Если ДоступныеЦелевыеОчереди.Количество()>0 Тогда
		ЭтаФорма.Отчет.ТекущаяОчередь  = ДоступныеЦелевыеОчереди[0].Значение;
	КонецЕсли;	
	
	ЭтаФорма.Отчет.Период = Новый СтандартныйПериод();
	ТекДата = ТекущаяДата();
	ЭтаФорма.Отчет.Период.ДатаНачала=НачалоДня(ТекДата);
	ЭтаФорма.Отчет.Период.ДатаОкончания=ТекДата;
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	СформируйГанта(Отчет.Период.ДатаНачала, Отчет.Период.ДатаОкончания, Отчет.ТекущаяОчередь)
КонецПроцедуры

&НаСервере
Процедура СформируйГанта(НачалоПериода, КонецПериода, Очередь) 
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АгентыИстория.Id КАК Id,
	|	АгентыИстория.eventtime КАК eventtime,
	|	АгентыИстория.queue_name КАК queue_name,
	|	АгентыИстория.member_name КАК member_name,
	|	ВЫБОР
	|		КОГДА АгентыИстория.old_value = 1
	|			ТОГДА ""Пауза""
	|		ИНАЧЕ ""Активен""
	|	КОНЕЦ КАК old_value,
	|	ВЫБОР
	|		КОГДА АгентыИстория.new_value = 1
	|			ТОГДА ""Пауза""
	|		ИНАЧЕ ""Активен""
	|	КОНЕЦ КАК new_value,
	|	АгентыИстория.members_count КАК members_count,
	|	ВЫБОР
	|		КОГДА АгентыИстория.old_value = 0
	|				И АгентыИстория.new_value = 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзРаботыВПаузу,
	|	ВЫБОР
	|		КОГДА АгентыИстория.old_value = 1
	|				И АгентыИстория.new_value = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзПаузыВРаботу
	|ИЗ
	|	ВнешнийИсточникДанных.AsteriskNnov.Таблица.АгентыИстория КАК АгентыИстория
	|ГДЕ
	|	АгентыИстория.queue_name = &queue_name
	|	И АгентыИстория.eventtime МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	eventtime
	|ИТОГИ ПО
	|	member_name";
	Запрос.УстановитьПараметр("queue_name", 		Очередь.Наименование);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",	КонецПериода);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	Если РезультатЗапроса.Пустой() Тогда
		Возврат
	КонецЕсли;
		
	Гант.Очистить();
	Гант.ОтображениеИнтервала=ОтображениеИнтервалаДиаграммыГанта.Плоский;
	//Гант.ЕдиницаПериодическогоВарианта	=	ТипЕдиницыШкалыВремени.День;
	Гант.ЕдиницаПериодическогоВарианта	=	ТипЕдиницыШкалыВремени.Час;

	Гант.ПоддержкаМасштаба				=	ПоддержкаМасштабаДиаграммыГанта.Период;
	
	//ЭтаФорма.Гант.ОтображатьЛегенду				=	Ложь;
	
	//Добавь серии (текущем варианте отображаем только одну серию - "заблокирован")
	//---------------------------------------------------------------------------			
	Если ЭтаФорма.Гант.Серии.Количество()=0 Тогда
			//Серия1 - "Работа"
			//------------------
			Серия1 = Гант.Серии.Добавить();
			Серия1.Значение	= "Работа";
			Серия1.Текст 		= "Работа";
			Серия1.Цвет 		= WebЦвета.Зеленый;
			
			//Серия2 - "Пауза"
			//-----------------------
			//Серия2 = ЭтаФорма.Гант.Серии.Добавить();
	 		//Серия2.Значение	= "Пауза";
	 		//Серия2.Текст 	= "Пауза";
			//Серия2.Цвет		= WebЦвета.Красный;		
	КонецЕсли;

	ВыбАгент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыбАгент.Следующий() Цикл
		Точка1 = Гант.Точки.Добавить();
		Точка1.Текст 	= ВыбАгент. member_name;
		Точка1.Значение = ВыбАгент. member_name;

		Начало = '00010101';
		Окончание = '00010101';

		ВыбВр = ВыбАгент.Выбрать(); //Выборка времени
		Пока ВыбВр.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Начало) Тогда
				Начало = ВыбВр.eventtime;
				Продолжить;
			КонецЕсли;

			Если ЗначениеЗаполнено(Начало) Тогда
					
				Окончание = ВыбВр.eventtime;
				
				Если ВыбВр.ИзРаботыВПаузу Тогда
					ЗначениеГанта = Гант.ПолучитьЗначение(Точка1, Серия1);
					ЗначениеГанта.Редактирование =Ложь;
					Интервал2 = ЗначениеГанта.Добавить();
	 				Интервал2.Начало = Начало;
					Интервал2.Конец = Окончание;
				КонецЕсли;
								
				Начало = Окончание;
				Окончание = '00010101';
				
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	ЭтаФорма.СкомпоноватьРезультат();
	СформируйГанта(Отчет.Период.ДатаНачала, Отчет.Период.ДатаОкончания, Отчет.ТекущаяОчередь);
КонецПроцедуры
